{
  "OmniGenomefold_config": null,
  "architectures": [
    "OmniGenomeModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_omnigenome.OmniGenomeConfig",
    "AutoModel": "modeling_omnigenome.OmniGenomeModel",
    "AutoModelForMaskedLM": "modeling_omnigenome.OmniGenomeForMaskedLM",
    "AutoModelForSeq2SeqLM": "modeling_omnigenome.OmniGenomeForSeq2SeqLM",
    "AutoModelForSequenceClassification": "modeling_omnigenome.OmniGenomeForSequenceClassification",
    "AutoModelForTokenClassification": "modeling_omnigenome.OmniGenomeForTokenClassification"
  },
  "classifier_dropout": null,
  "dtype": "float16",
  "emb_layer_norm_before": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0,
  "hidden_size": 480,
  "id2label": {
    "0": "0",
    "1": "1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2400,
  "is_folding_model": false,
  "label2id": {
    "0": 0,
    "1": 1
  },
  "layer_norm_eps": 1e-05,
  "mask_token_id": 23,
  "max_position_embeddings": 1026,
  "model_type": "omnigenome",
  "num_attention_heads": 24,
  "num_generation": 50,
  "num_hidden_layers": 16,
  "num_population": 100,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "token_dropout": true,
  "transformers_version": "4.57.0",
  "use_cache": true,
  "verify_ss": true,
  "vocab_list": null,
  "vocab_size": 24
}
